import React from "react";
import flights from "./data/flights_data.json";
import { useNavigate } from "react-router-dom";

import { useEffect, useState } from "react";

function Policy() {
  const navigate = useNavigate();
  const [data, setData] = useState("Connecting to the server...");

  useEffect(() => {
    fetch("http://localhost:5000/api/greeting")
      .then((response) => response.json())
      .then((data) => {
        console.log(data); // הדפסת התגובה בקונסול כדי לבדוק מה מתקבל
        setData(data.message);
      })
      .catch((error) => console.error("Error fetching data:", error));
  }, []);

  const handleSubmit = () => {
    // e.preventDefault(); //מונע מהדף לרפרש את עצמו
    navigate("/myGamingStore"); // חזרה לדף הראשי
  };

  return (
    <div>
      <h3 style={{ color: "greenyellow" }}>{data}</h3>
      <div style={{ display: "flex" }}>
        <button
          style={{ background: "grey", width: "90px" }}
          onClick={handleSubmit}
        >
          Go back
        </button>
        <h2 style={{ color: "black" }}>תקנון האתר</h2>
      </div>
      <h3>כללי</h3>
      <ul>
        <li>
          תקנון זה (להלן: "התקנון") מסדיר את תנאי ההתקשרות בין מפעילי אתר זה
          (להלן: "מפעילי האתר") ובין הגולש באתר (להלן: "הגולש"), אשר יכול לבצע
          רכישות באתר (להלן: "הרוכש") בכל הנוגע לשימוש באתר זה (להלן: "האתר").
        </li>
        <li>גלישה באתר מהווה הסכמת הגולש לתנאי התקנון.</li>
        <li>
          התקנון משתנה ומתעדכן מעת לעת ומחובת הגולש לבדוק את התקנון בכל גלישה
          באתר מחדש.
        </li>
        <li>
          במקרה שישנה אי התאמה בין האמור בתקנון לבין האמור בדפי המידע האחרים
          באתר (עמודים כגון: שירות לקוחות, שאלות נפוצות, משלוחים והחזרות) גובר
          האמור בתקנון זה.
        </li>
        <li>
          במקרה שישנה אי התאמה בין האמור בתקנון לבין האמור בדפי המוצר באתר
          (עמודים המציגים מוצרים למכירה) גובר האמור בדפי המוצר.
        </li>
      </ul>
      <h3>מוצרים שאזלו מהמלאי</h3>
      <ul>
        <li>
          כל ספק/יצרן /יבואן אחראי לעדכן את כמות הפריטים המצויים במלאי והעומדים
          למכירה, והחברה לא תהא אחראית לקיומם במלאי של המוצרים אצל כל
          ספק/יצרן/יבואן, למעט המוצרים שהיא מייבאת.
        </li>
        <li>
          החברה עושה כל מאמץ להציג באתר את המוצרים הקיימים במלאי אצל כל ספק בזמן
          אמת. אולם, לעיתים אוזל המלאי של מוצר מסוים לפני שהוא הוסר מהאתר.
        </li>
        <li>
          במקרה שמוצר אזל מהמלאי לפני שהוא הוסר מהאתר, הגורם הרלוונטי בחברה יצור
          קשר עם הלקוח, ויציע לו מוצר חלופי שמחירו זהה ככל שניתן.
        </li>
        <li>לחלופין, החברה תציע לבטל את העסקה.</li>
      </ul>
      <h3>אחריות והגבלת אחריות</h3>
      <ul>
        <li>
          האתר ניתן לגולש כשירות AS IS. מפעילי האתר עושים כל מאמץ להפעלה תקינה
          של האתר. מפעילי האתר מסירים מעצמם אחריות, אם הגלישה באתר הופרעה מכל
          סיבה שהיא, לרבות עקב בעיות בגלישה, תקלות בחומרה, בעיות בתאימות
          לדפדפנים או למכשירים או למסכים שונים, אי זמינות האתר או חלקים ממנו או
          אי יכולת לבצע רכישה באתר.
        </li>
        <li>
          מפעילי האתר מסירים מעצמם אחריות לפעילות גולשים שנעשתה בצורה לא חוקית
          ו/או לא אחראית, לרבות פעילות שגרמה לנזקים לצד ג'.
        </li>
        <li>מפעילי האתר מסירים מעצמם אחריות לתכני הגולשים באתר.</li>
      </ul>
      <h3>מדיניות פרטיות</h3>
      <ul>
        <li>מדיניות הפרטיות מפורטת במסמך מדיניות הפרטיות.</li>
        <li>מדיניות הפרטיות מהווה חלק בלתי נפרד מתקנון זה.</li>
      </ul>
      <h3>יצירת קשר</h3>
      <ul>
        <li>
          ניתן ליצור קשר עם מפעילי האתר בכל נושא באמצעות מילוי טופס פניה בעמוד
          יצירת הקשר באתר.
        </li>
      </ul>

      <div dir="ltr">
        {flights.map((fli) => (
          <div key={fli.flight_id}>
            <p>id: {fli.flight_id}</p>
            <p>the flight going from: {fli.origin}</p>
            <p>to -- {fli.destination}</p>
            <p>------------------</p>
          </div>
        ))}
      </div>
    </div>
  );
}

export default Policy;
